<script setup>
import Button from 'primevue/button';
</script>

<template>
  <header class="flex justify-end p-6">
    <Button label="Info" severity="info" variant="link">
      <router-link :to="'/'">Home</router-link>
    </Button>
  </header>
  <div class="grid gap-8 w-200 m-auto p-10">
    <h2 class="text-2xl">О задании</h2>
    <p>
      Метод https://www.googleapis.com/books/v1/volumes не возвращает результат без query параметра,
      так что в приложении сначала осуществляется поиск, а потом отображение книг в табличном виде.
    </p>
    <p>
      Бесконечный скролл срабатывает на PrimeVue DataTable сотни раз, хотя скролл не достигает низа
      элемента. Пробовала и через virtualScrollerOptions, и простым обработчиком события. Буду
      признательна, если поделитесь, как с этим справляетесь)
    </p>
    <p>
      Пункт "Редактирование наименования книги" не был реализован, так как Google Books API не
      включает такую возможность. (Редактирование книги через Google Books API возможно только в том
      случае, если у вас есть права на управление этой книгой (например, если вы являетесь издателем
      или владельцем контента). Google Books API в основном предназначен для поиска и получения
      информации о книгах, а не для их редактирования.)
    </p>
    <h2 class="text-2xl">Обо мне</h2>
    <p>
      Училась в ИМиКН, Работала в основном в Schlumberger и в стартапе, разрабатывающем промышленный
      маркетплейс. Между ними путешествовала. Сейчас в Тюмени - купила квартиру и здесь же ищу
      работу.
    </p>
    <p>Увлекаюсь музыкой, физкультурой, прогулками и рисованием.</p>
    <p>Нравится учиться и узнавать новое.</p>
  </div>
</template>

<style>
@media (min-width: 1024px) {
  .about {
    min-height: 100vh;
    display: flex;
    align-items: center;
  }
}
</style>
